package day09_test.test1;

public class Test1 {
    /*1. 什么是接口，如何定义接口？
            接口，是Java语言中一种引用类型，是方法的集合。  
            使用interface关键定义接口，其中可以定义抽象方法，默认方法，私有方法，静态方法。
            格式：interface 接口名{方法}；
            实现格式： 实现类 implement 接口名{}

    2. 什么叫做多态，条件是什么？
            多态就是不同类的对象对同一消息做出不同的响应
                实现多态要满足三个条件
                    1：必须要有继承关系
                    2：父类引用必须指向子类
                    3：子类继承父类的方法
    3. 使用多态特性，带来了什么样的好处？
           可以增强方法的扩展性和复用性

    4. 使用多态特性，注意什么样的弊端？
            不能调用子类特有的方法，如果要调用，必须向下转型

     */
}
